resources/WCS/test/soapGetCoverage.xml

<?xml version="1.0" encoding="UTF-8"?>
<Envelope xmlns="http://www.w3.org/2003/05/soap-envelope" >
    <Body>
        <GetCoverage xmlns="http://www.opengis.net/wcs/1.1" xmlns:ows="http://www.opengis.net/ows/1.1" service="WCS" version="1.1.2">
            <ows:Identifier>S1/opendap/ioos/200803061600_HFRadar_USEGC_6km_rtv_SIO.ncml</ows:Identifier>
            <DomainSubset>
                <ows:BoundingBox>
                    <ows:LowerCorner>-80 30</ows:LowerCorner>
                    <ows:UpperCorner>-60 50</ows:UpperCorner>
                </ows:BoundingBox>
            </DomainSubset>
            <Output format="application/netcdf"/>
        </GetCoverage>
    </Body>
</Envelope>
